[
  {
    "name": "Dani Weir",
    "school": "Woodinville",
    "bgcolor": "red",
    "sport": "Softball",
    "position": "Coach",
    "image": "/assets/athletes/sts16_weir_dani.JPG"
  },
  {
    "name": "Delaney Nelson",
    "school": "Tahoma",
    "bgcolor": "red",
    "sport": "Softball",
    "position": "Infielder",
    "year": "Senior",
    "image": "/assets/athletes/sts16_nelson_delaney.JPG"
  },
  {
    "name": "Gabby Wenn",
    "school": "West Seattle",
    "bgcolor": "orange",
    "sport": "Softball",
    "position": "Outfielder",
    "year": "Senior",
    "image": "/assets/athletes/sts16_wenn_gabby.JPG"
  },
  {
    "name": "Quinn Breidenbach",
    "school": "Enumclaw",
    "bgcolor": "green",
    "sport": "Softball",
    "position": "Infielder",
    "year": "Senior",
    "image": "/assets/athletes/sts16_breidenbach_quinn.JPG"
  },
  {
    "name": "Jourdin Hering",
    "school": "Beamer",
    "bgcolor": "yellow",
    "sport": "Softball",
    "position": "Outfielder",
    "year": "Senior",
    "image": "/assets/athletes/sts16_hering_jourdin.JPG"
  },
  {
    "name": "Carley Nance",
    "school": "Tahoma",
    "bgcolor": "red",
    "sport": "Softball",
    "position": "Outfielder",
    "year": "Senior",
    "image": "/assets/athletes/sts16_nance_carley.JPG"
  },
  {
    "name": "Alyssa Simons",
    "school": "Snohomish",
    "bgcolor": "red",
    "sport": "Softball",
    "position": "Pitcher",
    "year": "Senior",
    "image": "/assets/athletes/sts16_simons_alyssa.JPG"
  },
  {
    "name": "Sophie Frost",
    "school": "Jackson",
    "bgcolor": "green",
    "sport": "Softball",
    "position": "Pitcher",
    "year": "Senior",
    "image": "/assets/athletes/sts16_frost_sophie.JPG"
  },
  {
    "name": "Tori Bivens",
    "school": "Lake Washington",
    "bgcolor": "orange",
    "sport": "Softball",
    "position": "Utitlity",
    "year": "Junior",
    "image": "/assets/athletes/sts16_bivens_tori.JPG"
  },
  {
    "name": "Maggie Gallagher",
    "school": "Kennedy Catholic",
    "bgcolor": "yellow",
    "sport": "Softball",
    "position": "Infielder",
    "year": "Senior",
    "image": "/assets/athletes/sts16_gallagher_maggie.JPG"
  },
  {
    "name": "Emma Helm",
    "school": "Meadowdale",
    "bgcolor": "green",
    "sport": "Softball",
    "position": "Catcher",
    "year": "Junior",
    "image": "/assets/athletes/sts16_helm_emma.JPG"
  },
  {
    "name": "Maddie Morgan",
    "school": "Lynnwood",
    "bgcolor": "yellow",
    "sport": "Softball",
    "position": "Infielder",
    "year": "Junior",
    "image": "/assets/athletes/sts16_morgan_maddie.JPG"
  },
  {
    "name": "Christian Jones",
    "school": "Federal Way",
    "bgcolor": "orange",
    "sport": "Baseball",
    "position": "Infielder",
    "year": "Senior",
    "blurb": "The future Washington Husky fills up a box score. Jones batted .444, up from .346 as a junior, had seven doubles, two triples and six home runs. He scored 28 runs (he scored nine as a junior) and had 25RBI. Every one of those numbers is a career-best. During the post season, he simply got pitched around. At the district tournament, he was just 1-for-2, but had five walks and a hit by pitch. ",
    "image": "/assets/athletes/sts16_jones_christian.JPG"
  },
  {
    "name": "Paul Falco",
    "school": "Lake Washington",
    "bgcolor": "blue",
    "sport": "Baseball",
    "position": "Outfielder",
    "year": "Senior",
    "blurb": "Falco was voted the Kingco 3A most valuable player. In the outfield, he has 16 putouts and four assists, made no errors and batted .291 with two home runs, 12 runs scored and 14 RBI. On the mound, he is 10-0 this season with 47 strikeouts, a 0.95 WHIP, and a 1.76 ERA in 51 2/3 innings. ",
    "image": "/assets/athletes/sts16_falco_paul.JPG"
  },
  {
    "name": "Ben Hinthorne",
    "school": "Lakeside",
    "bgcolor": "yellow",
    "sport": "Baseball",
    "position": "Utility",
    "year": "Junior",
    "blurb": "Hinthorne led the Metro League this season with eight victories, going 8-0 in the regular season for the division-winning Lions. He’s now 10-0 overall with six complete games, a 1.05 ERA and 48 strikeouts in 60 innings. Offensively, he’s batting .410 with 26 runs scored and 29 RBI.",
    "image": "/assets/athletes/sts16_hinthorne_ben.JPG"
  },
  {
    "name": "Ryan Shaw",
    "school": "Lakeside",
    "bgcolor": "blue",
    "sport": "Baseball",
    "position": "Catcher",
    "year": "Senior",
    "blurb": "Shaw has delivered virtually every time he’s had an opportunity, literally. He has been on base two out of every three plate appearances this season (.646), and is batting.562 with an astronomical 43 RBI. Lakeside’s field general has 13 doubles, two triples and five home runs for the state semifinal-bound Lions.",
    "image": "/assets/athletes/sts16_shaw_ryan.JPG"
  },
  {
    "name": "Jordan Jones",
    "school": "Kentwood",
    "bgcolor": "blue",
    "sport": "Baseball",
    "position": "Pitcher",
    "year": "Senior",
    "blurb": "Jones, a Washington Husky signee, is 10-0 with a 1.25 ERA for the SPSL 4A Northeast division-winning Conquerors. He’s held opponents to a miniscule .153 batting average and accumulated 97 strikeouts to just 19 walks. Jones finished off a career in which he suffered only two losses in four seasons for Kentwood.",
    "image": "/assets/athletes/sts16_jones_jordan.JPG"
  },
  {
    "name": "Morgan McCullough",
    "school": "West Seattle",
    "bgcolor": "orange",
    "sport": "Baseball",
    "position": "Infielder",
    "year": "Senior",
    "blurb": "A three-time Star Times member, McCullough hit .411 with five doubles, a triple and three home runs. The senior also scored 23 runs, drove in 13 runs  and stole seven bases. With extremely quick hands and great range at shortstop, McCullough, who had 46 putous out of 50, is a well-rounded player.",
    "image": "/assets/athletes/sts16_mccullough_morgan.JPG"
  },
  {
    "name": "Ben Koler",
    "school": "Federal Way",
    "bgcolor": "red",
    "sport": "Baseball",
    "position": "Infielder",
    "year": "Senior",
    "blurb": "Koler took a giant leap forward at the plate this season, raising his batting average for the Northwest division winners to .510 from .347 as a junior. The second baseman scored 31 runs, and stole nine bases in 10 attempts. Those numbers included a 3 for 4 performance in a 3-2 regional semifinal loss to Woodinville.",
    "image": "/assets/athletes/sts16_koler_ben.JPG"
  },
  {
    "name": "Rhyse Frey",
    "school": "Kennedy Catholic",
    "bgcolor": "green",
    "sport": "Baseball",
    "position": "Pitcher",
    "year": "Senior",
    "blurb": "Frey has been nothing short of spectacular for the Lancers this season, compiling a 0.70 earned run average in 50 innings, going 7-1 overall with one save in his only opportunity. Frey also has a 0.72 WHIP and has struck out 95 opposing batters.",
    "image": "/assets/athletes/sts16_frey_rhyse.JPG"
  },
  {
    "name": "Taylor Wright",
    "school": "Eastside Catholic",
    "bgcolor": "yellow",
    "sport": "Baseball",
    "position": "Outfielder",
    "year": "Senior",
    "blurb": "Wright has five outfield assists for a team that won the Valley division of the Metro League with a 16-4 regular-season record. He batted .423 with 13 doubles and a home run, scored 22 runs, had 18 RBI and eight stolen bases. Has signed a letter of intent to play at Oregon State next season.",
    "image": "/assets/athletes/sts16_wright_taylor.JPG"
  },
  {
    "name": "Harrison Jacobs",
    "school": "Shorewood",
    "bgcolor": "yellow",
    "sport": "Baseball",
    "position": "Outfielder",
    "year": "Senior",
    "blurb": "A repeat selection to this team, Jacobs batted.377 with 26 RBI, 20 runs scored, seven doubles and four home runs. He stole six bases in seven attempts. Defensively, he handled 37 opportunities, made 32 putouts and had five assists while not making an error.",
    "image": "/assets/athletes/sts16_jacobs_harrison.JPG"
  },
  {
    "name": "Matt Williams",
    "school": "Archbishop Murphy",
    "bgcolor": "blue",
    "sport": "Soccer",
    "position": "Forward",
    "year": "Junior",
    "blurb": "Williams was a big reason the Wildcats (19-1-0) won the Cascade Conference with a perfect 14-0-0 record and reached the Class 2A Final Four for the sixth time. The  playmaker supplied 32 goals and 10 assists for the defending state champions. “He’s a total finisher,” ATM coach Michael Bartley said. ",
    "image": "/assets/athletes/sts16_williams_matt.JPG"
  },
  {
    "name": "Cris Garfias-Jolley",
    "school": "Tahoma",
    "bgcolor": "red",
    "sport": "Soccer",
    "position": "Forward",
    "year": "Junior",
    "blurb": "The Bears’ top scorer and Co-SPSL North Offensive MVP might not be that intimidating at 5-foot-8, 150 pounds, but his moves on the soccer pitch are jaw-dropping. Garfias’ elusiveness on the field has yielded 27 goals and 10 assists, leading Tahoma to the Class 4A Final Four for the first time since 1996.   “This kid is amazing to watch,” Tahoma coach Jason Johnson said. ”",
    "image": "/assets/athletes/sts16_garfias_cris.JPG"
  },
  {
    "name": "Justin Soto",
    "school": "Lake Washington",
    "bgcolor": "red",
    "sport": "Soccer",
    "position": "Defender",
    "year": "Senior",
    "blurb": "The Kangaroos’ stopper possesses great size and range at 6-foot-1, 175 pounds. He was a tough matchup for strikers in KingCo 3A/2A this spring and when confronted 1-on-1, he won many of those individual battles. Soto will play for Lafayette College (Pa.) of the Patriot League, starting in the fall. He has been named Lake Washington’s team MVP the last two seasons while captain both years.",
    "image": "/assets/athletes/sts16_soto_justin.JPG"
  },
  {
    "name": "Colin Rigby",
    "school": "Mercer Island",
    "bgcolor": "green",
    "sport": "Soccer",
    "position": "Coach",
    "blurb": "With an uncertain lineup and just one starter back, Rigby guided the Islanders  into the Class 3A state Final Four. Mercer Island went a perfect a 12-0-0 to capture the KingCo 3A/2A conference title for the second season in a row. The Islanders (17-1-1) outscored opponents 63-16. The fourth-year leader for the Islanders, Rigby led the program to second in 3A state in 2014, his second year as head coach. Rigby’s record with the Islanders is 49-16-13 so far.",
    "image": "/assets/athletes/sts16_rigby_colin.JPG"
  },
  {
    "name": "Sten Tolgu",
    "school": "Garfield",
    "bgcolor": "orange",
    "sport": "Soccer",
    "position": "Goalkeeper",
    "year": "Senior",
    "blurb": "The Bulldogs’ defense was stout against Metro League competition and Tolgu yielded just nine goals in going 10-4-0 for second place in the Sound Division. Tolgu posted nine shutouts and an 0.71 goals-against average, allowing just  nine goals in 1,010 minutes before state. A two-year starter and captain, Tolgu helped the Bulldogs into state for the fifth time in seven seasons. ",
    "image": "/assets/athletes/sts16_tolgu_sten.JPG"
  },
  {
    "name": "Miles Sanchez",
    "school": "Woodinville",
    "bgcolor": "blue",
    "sport": "Soccer",
    "position": "Midfielder",
    "year": "Senior",
    "blurb": "The KingCo 4A offensive Most Valuable Player this spring, Sanchez put up 14 goals and eight assists in just 12 matches. “He is a nightmare for any other team to match up with, can beat you off the dribble, shoot from distance,  strong at defending, and a great leader for us,” Woodinville coach Nathan Davis said.” Sanchez put up the most goals in KingCo 4A this spring. The Falcons came up one victory short of reaching the 4A state tournament.",
    "image": "/assets/athletes/sts16_sanchez_miles.JPG"
  },
  {
    "name": "Connor Seed",
    "school": "Glacier Peak",
    "bgcolor": "orange",
    "sport": "Soccer",
    "position": "Midfielder",
    "year": "Senior",
    "blurb": "When healthy, there’s little doubt about the talent Seed brings to the game. After missing six matches to recover from meniscus surgery on his knee, the senior captain supplied12 goals and seven assists. The Western Washington University commit was a major reason the Grizzlies captured the WesCo 3A regular-season crown at 12-0-0 and outscored foes 45-1. The center midfielder helped the program into the 3A state tournament for the fifth time in seven seasons. Glacier Peak (16-5-0) beat Capital 3-2 to open state action this week after a surprise 2-0 loss to Edmonds Woodway in the 3A Northwest District championship game. ",
    "image": "/assets/athletes/sts16_seed_connor.JPG"
  },
  {
    "name": "Sam Johnson",
    "school": "O'Dea",
    "bgcolor": "yellow",
    "sport": "Soccer",
    "position": "Defender",
    "year": "Senior",
    "blurb": "The Irish defense, led by Johnson, allowed just 11 goals in the regular season. Thanks in large part to the senior, O’Dea finished atop the Metro League’s Sound Division at 11-1-2. O’Dea reached the Metro tournament, but was upset in the semifinals by Lakeside 1-0 to end its first above .500 season in five seasons. The Irish went 11-3-2 and outscored foes 43-12. Johnson will take his talents to Whittier College (Calif.), a NCAA Division 3 liberal arts institution. ",
    "image": "/assets/athletes/sts16_johnson_sam.JPG"
  },
  {
    "name": "Jimmy Boyce",
    "school": "Mount Si",
    "bgcolor": "green",
    "sport": "Baseball",
    "position": "Infielder",
    "year": "Senior",
    "blurb": "Boyce was the glue for the Wildcat infield this season, batting .407 with 12 runs scored, 10 RBI, six doubles and a home run. He had a .596 on-base percentage during the regular season. Pitching mostly in relief (three starts), Boyce amassed a team-high 48.2 innings, a 3-1 record with a 1.15 ERA, 62 strikeouts and an opponent batting average of .209. The lone loss was a complete-game, 1-0 loss to Gig Harbor in the regional semifinals on Sunday.",
    "image": "/assets/athletes/sts16_boyce_jimmy.JPG"
  },
  {
    "name": "Dale Dolejsi",
    "school": "Kennedy Catholic",
    "bgcolor": "green",
    "sport": "Baseball",
    "position": "Coach",
    "blurb": "Kennedy Catholic won the Seamount League title for the third straight year - that’s every season Dolesji has coached the Lancers — after a 15-year drought. Previous to 2014, Kennedy’s last league title was in 1999, also the last time the Lancers won the state title. Dolejsi pitched at Lindberg High School from 1988-91. He was drafted after high school by the Cleveland Indians, but turned down the offer to attend college. He played one year with Edmonds Community College before transferring to University of the Pacific in Stockton, CA. ",
    "image": "/assets/athletes/sts16_dolejsi_dale.JPG"
  },
  {
    "name": "Ty Good",
    "school": "Skyline",
    "bgcolor": "red",
    "sport": "Soccer",
    "position": "Forward",
    "year": "Senior",
    "blurb": "The Spartans can get whatever is needed up front from Good, who finished with 10 goals and 11 assists. Good provided timely goals and precision passes and that helped the Spartans win the KingCo 4A championship in dominant fashion. The team captain was named an All-KingCo 4A first-team pick on a Skyline team that is currently ranked 40th in the TopDrawerSoccer National Spring Fab 50. “Ty has the unique ability to make all others around him better,” Skyline coach Don Braman said. “His distribution and leadership are often overshadowed by the fact that he can throw his team on his shoulders when the situation dictates.”",
    "image": "/assets/athletes/sts16_good_ty.JPG"
  },
  {
    "name": "Grant Holland",
    "school": "Skyline",
    "bgcolor": "yellow",
    "sport": "Soccer",
    "position": "Defender",
    "year": "Senior",
    "blurb": "Holland, a four-year varsity player, is one of the main reasons the Spartans are organized on the back line. The KingCo 4A defensive Most Valuable Player keeps the team’s defense tight, which  led to a decisive 43-15 goals advantage.  “He has really shined this season, leading the Spartans to both a regular-season championship and a victory in the league championship game,” Skyline coach Don Braman said.",
    "image": "/assets/athletes/sts16_holland_grant.JPG"
  },
  {
    "name": "Erik de Anda",
    "school": "Auburn Mountainview",
    "bgcolor": "orange",
    "sport": "Soccer",
    "position": "Forward",
    "year": "Senior",
    "blurb": "DeAnda has proven over and over that he’s scoring threat at any moment. Heading into the Class 3A state tournament, he has amassed 26 goals and four assists. The Lions (16-3-0) won the SPSL 3A regular season title for the first time and  captured the school’s first 3A West Central District title with a dominant 4-0 win over Capital on May 14. The first-team All-SPSL 3A selection has done plenty for the program. “Hard worker who is always perfecting his craft before, during and after practice,” Auburn Mountainview coach Jason Shrader said. “He has uncanny body control and placement of shots.”",
    "image": "/assets/athletes/sts16_deanda_erik.JPG"
  },
  {
    "name": "Christian Rotter",
    "school": "Auburn Mountainview",
    "bgcolor": "green",
    "sport": "Soccer",
    "position": "Midfielder",
    "year": "Senior",
    "blurb": "Rotter is the perfect teammate, usually deferring to others as the Lions’ set-up man on a history-making team. His unselfishness — with 18 assists and six goals — was a big reason that the program scored firsts with a regular-season SPSL 3A title and West Central District tournament crown. The SPSL 3A MVP will take his talents to Western Washington University in the fall. “Superb leadership and full of character,” said Lions coach Jason Shrader. ",
    "image": "/assets/athletes/sts16_rotter_christian.JPG"
  }
]